source/_posts/test.html
title: 建博记
date: 2015-10-07
category: 随笔
description: 建立个人博客的前前后后
tags: [随笔]
toc: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 起因</h2>
<div class="outline-text-2" id="text-1">
<p>
现在看来博客貌似是个过时的东西，都微博、微信了，还有人写这个？但是作为一个码农，如果没有一个独立博客，感觉都不好意思跟别人打招呼。
而且，看了李笑来老师的<a href="http://mindhacks.cn/2009/02/15/why-you-should-start-blogging-now/">为什么你应该（从现在开始就）写博客</a>, 觉得不写一个博客就真的说不过去了。最重要的是，自己对于知识的沉淀和输出确实不够。
于是，决定建立一个自己的独立博客。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 寻寻觅觅</h2>
<div class="outline-text-2" id="text-2">
<p>
决定建独立博客之后，就开始考虑实现方案了。
总的来说，过程是曲折的！
首先，不管用什么方法写博客、生成静态内容，使用github pages托管博客内容是没有疑问的；
其次，因为最近在用Org Mode做TODO管理，觉得是一个很不错的工具，就想使用Org Mode写博客。
那么问题来了，用什么生成html页面呢？
大概也调研了一下，主要是使用Org Mode导出静态页面或者使用第三方工具的方法：
</p>
<ul class="org-ul">
<li>最简单的方法，通过增加配置来导出html页面，主要参考这个：<a href="http://www.kuqin.com/shuoit/20150804/347399.html">使用Emacs org-mode + GitHub Pages来写博客</a>
</li>
<li>使用现有的一些博客工具或插件：<a href="http://orgmode.org/worg/org-blog-wiki.html">Blogging Tools</a>
</li>
</ul>
<p>
第一种方法比较原生态，可定制性强，但是目前来说对emacs不太熟悉，就不想花太多时间；第二种也尝试了几个工具，比如o-blog、org-page，在使用中都有各种各样的问题。
，后来又发现了<a href="https://github.com/LeslieZhu/OrgNote">OrgNote</a>, 安装使用都比较简单，比较满足自己的要求，但是theme个人不太喜欢。后来发现hexo也不错，跟Org Mode结合的方法一个是直接生成html页面；
另一个是有个emacs的插件<a href="https://github.com/coldnew/org-hexo">org-hexo</a>， 但是这个插件依赖太多，搞的自己头晕眼花，只好暂时作罢，等emacs熟悉了，再回头研究研究。
所以，最后决定使用hexo+Org Mode的org-publish-current-file的方式来管理博客内容。
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> hexo + Org Mode + github pages</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 安装hexo</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> 安装Node.js</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
可以使用<a href="https://github.com/creationix/nvm">nvm</a> 安装Node.js，如果还没有安装nvm，则先安装它。
</p>
<div class="org-src-container">

<pre class="src src-sh" id="wget">wget https://raw.github.com/creationix/nvm/master/install.sh
sh install.sh
</pre>
</div>
<p>
nvm安装好之后，可以使用nvm安装Node.js。
</p>
<div class="org-src-container">

<pre class="src src-sh">nvm install v4.1.2
</pre>
</div>
<p>
<b><b>ps:</b></b> 我在使用这种方法安装的时候，一直卡着不动。于是从<a href="http://nodejs.org/">官网</a> 下载了安装包，直接安装，很快。
</p>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> 安装hexo</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
直接使用npm安装hexo（也是很慢，而且也没个进度，体验很不好）。
</p>
<div class="org-src-container">

<pre class="src src-sh">npm install -g hexo-cli
</pre>
</div>
<p>
hexo的执行脚本没有加入到PATH变量，直接加一下就可以了
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #00ff00;">export</span> <span style="color: #0000ff;">PATH</span>= /usr/local/lib/node_modules/hexo-cli/bin/:$<span style="color: #0000ff;">PATH</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 快速使用hexo</h3>
<div class="outline-text-3" id="text-3-2">
<p>
安装好hexo之后，可以看下效果。
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #00ff00;">cd</span> ~
hexo init myblog
<span style="color: #00ff00;">cd</span> myblog
npm install
hexo server
</pre>
</div>
<p>
<b><b>ps:</b></b> 如果npm install失败的话，使用sudo安装。
启动成功后，在浏览器输入<a href="http://0.0.0.0:4000">http://0.0.0.0:4000</a>, 看到页面加载就大功告成！
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 配置hexo站点</h3>
<div class="outline-text-3" id="text-3-3">
<p>
配置站点信息，主要修改<sub>config</sub>.yml文件，具体可以看这个文件里面的内容。
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 配置Org Mode</h3>
<div class="outline-text-3" id="text-3-4">
<p>
因为使用Org Mode编写博客，而hexo不支持org文件，所以，需要配置Org Mode将org文件导出html，放在hexo项目的source/<sub>posts目录下。</sub>
具体配置如下：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-publish-project-alist
      '(
        (<span style="color: #00ffff;">"org-hexo"</span>
         <span style="color: #00ff00;">:base-directory</span> <span style="color: #00ffff;">"~/myblog/source/_posts/org/"</span>
         <span style="color: #00ff00;">:base-extension</span> <span style="color: #00ffff;">"org"</span>
         <span style="color: #00ff00;">:publishing-directory</span> <span style="color: #00ffff;">"~/myblog/source/_posts/"</span>
         <span style="color: #00ff00;">:recursive</span> t
         <span style="color: #00ff00;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #00ff00;">:headline-levels</span> 4             <span style="color: brightgreen; font-style: italic;">; </span><span style="color: brightgreen; font-style: italic;">Just the default for this project.</span>
         <span style="color: #00ff00;">:auto-preamble</span> t
         <span style="color: #00ff00;">:body-only</span> t
         )
        (<span style="color: #00ffff;">"org-static"</span>
         <span style="color: #00ff00;">:base-directory</span> <span style="color: #00ffff;">"~/myblog/source/_posts/org/"</span>
         <span style="color: #00ff00;">:base-extension</span> <span style="color: #00ffff;">"css</span><span style="color: #ffff00;">\\</span><span style="color: brightred;">|</span><span style="color: #00ffff;">js</span><span style="color: #ffff00;">\\</span><span style="color: brightred;">|</span><span style="color: #00ffff;">png</span><span style="color: #ffff00;">\\</span><span style="color: brightred;">|</span><span style="color: #00ffff;">jpg</span><span style="color: #ffff00;">\\</span><span style="color: brightred;">|</span><span style="color: #00ffff;">gif</span><span style="color: #ffff00;">\\</span><span style="color: brightred;">|</span><span style="color: #00ffff;">pdf</span><span style="color: #ffff00;">\\</span><span style="color: brightred;">|</span><span style="color: #00ffff;">mp3</span><span style="color: #ffff00;">\\</span><span style="color: brightred;">|</span><span style="color: #00ffff;">ogg</span><span style="color: #ffff00;">\\</span><span style="color: brightred;">|</span><span style="color: #00ffff;">swf"</span>
         <span style="color: #00ff00;">:publishing-directory</span> <span style="color: #00ffff;">"~/myblog/source/"</span>
         <span style="color: #00ff00;">:recursive</span> t
         <span style="color: #00ff00;">:publishing-function</span> org-publish-attachment
         )
        (<span style="color: #00ffff;">"org"</span> <span style="color: #00ff00;">:components</span> (<span style="color: #00ffff;">"org-hexo"</span> <span style="color: #00ffff;">"org-static"</span>))
        ))
</pre>
</div>
<p>
org-hexo将org文件转成html文件，org-static直接复制base-extension匹配的文件到指定目录。org将org-hexo和org-static组合起来，完成转换和拷贝静态文件的操作。
使用的时候，在emacs里直接键入M-x org-publish-current-file或者org-publish-current-project既可把org文件转成html文件并拷贝到hexo项目的source/<sub>posts目录下。</sub>
这样，hexo就可以正常处理这些文件。
</p>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 写博客（org文件）</h3>
<div class="outline-text-3" id="text-3-5">
<p>
写org博客的时候，hexo对文件格式有一定的要求，比如文章标题，发布日期，tags等，定义的格式可以是yaml或者json，具体见<a href="https://hexo.io/docs/front-matter.html">Front Matter</a>。
那我们需要在org文件的最开始加入一些标记：
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: brightgreen; font-style: italic;">#</span><span style="color: brightgreen; font-style: italic;">+OPTIONS: toc:nil </span>
<span style="color: brightgreen; font-style: italic;">#</span><span style="color: brightgreen; font-style: italic;">+STARTUP: showall indent</span>
<span style="color: brightgreen; font-style: italic;">#</span><span style="color: brightgreen; font-style: italic;">+STARTUP: hidestars</span>
<span style="color: brightgreen; font-style: italic;">#</span><span style="color: brightgreen; font-style: italic;">+BEGIN_HTML</span>
title: &#24314;&#21338;&#35760;
date: 2015-10-07
category: &#38543;&#31508;
description: &#24314;&#31435;&#20010;&#20154;&#21338;&#23458;&#30340;&#21069;&#21069;&#21518;&#21518;
tags: [&#38543;&#31508;]
---
<span style="color: brightgreen; font-style: italic;">#</span><span style="color: brightgreen; font-style: italic;">+END_HTML</span>
</pre>
</div>
<p>
关于源码显示的问题，直接使用Org Mode的#+BEGIN<sub>SRC、</sub>#+END<sub>SRC的话，渲染的结果不好看，有问题。</sub>
可以使用下面的方法可以解决这个问题：
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: brightgreen; font-style: italic;">#</span><span style="color: brightgreen; font-style: italic;">+BEGIN_HTML</span>
<span style="color: #fa8072;">``` bash</span>
<span style="color: #fa8072;">$ hexo new "My New Post"</span>
<span style="color: #fa8072;">```</span>
<span style="color: brightgreen; font-style: italic;">#</span><span style="color: brightgreen; font-style: italic;">+END_HTML</span>
</pre>
</div>
<p>
但是这样就有点违反使用Org Mode的原则了，是不是有其他什么方法，带解决！
</p>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 发布到github page</h3>
<div class="outline-text-3" id="text-3-6">
<p>
首先，得有一个github账号，没有就注册一个，注册完之后，新建一个repository，repository的名字为：github用户名.github.io。
需要建一个hexo分支用于存储hexo项目的所有文件，具体操作如下
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #00ff00;">cd</span> ~/myblog
hexo clean
git init
git checkout -b hexo
git add .
git commit -m <span style="color: #00ffff;">'first commit'</span>
git remote add origin git@smashell.github.com:smashell/smashell.github.io.git
git push -u origin hexo
</pre>
</div>
<p>
这样在smashell.github.io库中新建了一个hexo分支，文件也都上传到github上去了。
然后，把生成的静态内容放到master分支中去。
</p>
<div class="org-src-container">

<pre class="src src-sh">git checkout master
hexo generate
<span style="color: #00ff00;">cd</span> public
git add .
git commit -m <span style="color: #00ffff;">'first commit'</span>
git push -u origin master
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 结果</h2>
<div class="outline-text-2" id="text-4">
<p>
以前没怎么写过博客，写的都是些短篇内容，现在写博客才知道，要想写一篇好的内容真是不容易啊！
但是，毕竟向前跨出了一步，虽然有点晚，但是总比不做强。
希望自己可以坚持下去。
</p>
</div>
</div>
